; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v5 - type_3 ?v8 - type_1)
 	      (pred_1 ?v2 - object ?v8 - type_1)
	      (pred_3 ?v5 - type_3 ?v1 - type_2)
	      (pred_4 ?v5 - type_3 ?v2 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v5 - type_3 ?v3 ?v6 - type_1)
       :precondition (and  (pred_2 ?v5 ?v3))
       :effect (and  (pred_2 ?v5 ?v6)
		     (not (pred_2 ?v5 ?v3))))

   (:action op_3
       :parameters (?v5 - type_3 ?v7 - object ?v4 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v4) (pred_2 ?v5 ?v4) (pred_3 ?v5 ?v1))
       :effect (and (pred_4 ?v5 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v4)) 
		    (not (pred_3 ?v5 ?v1))))

   (:action op_1
       :parameters (?v5 - type_3 ?v7 - object ?v4 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v7 ?v1) (pred_2 ?v5 ?v4))
       :effect (and (pred_1 ?v7 ?v4)
		    (pred_3 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v7 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_01 obj_04 - type_3
obj_06 obj_05 obj_11 obj_02 - type_2
obj_03 obj_07 obj_08 - type_1
obj_10 obj_09 - object)
(:init
(pred_2 obj_01 obj_08)
(pred_3 obj_01 obj_06)
(pred_3 obj_01 obj_05)
(pred_2 obj_04 obj_07)
(pred_3 obj_04 obj_11)
(pred_3 obj_04 obj_02)
(pred_1 obj_10 obj_07)
(pred_1 obj_09 obj_07)
)
(:goal
(and
(pred_1 obj_10 obj_08)
(pred_1 obj_09 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_01 obj_08) (pred_2 obj_04 obj_08))))
  )
)
)

; plan
1. (op_3 obj_04 obj_10 obj_07 obj_02)
   deleted: (pred_1 obj_10 obj_07) (pred_3 obj_04 obj_02)
   added: (pred_4 obj_04 obj_10 obj_02)
   goals met: 0 of 2
2. (op_3 obj_04 obj_09 obj_07 obj_11)
   deleted: (pred_1 obj_09 obj_07) (pred_3 obj_04 obj_11)
   added: (pred_4 obj_04 obj_09 obj_11)
   goals met: 0 of 2
3. (op_2 obj_01 obj_08 obj_03)
   deleted: (pred_2 obj_01 obj_08)
   added: (pred_2 obj_01 obj_03)
   goals met: 0 of 2
4. (op_2 obj_04 obj_07 obj_03)
   deleted: (pred_2 obj_04 obj_07)
   added: (pred_2 obj_04 obj_03)
   goals met: 0 of 2
5. (op_1 obj_04 obj_09 obj_03 obj_11)
   deleted: (pred_4 obj_04 obj_09 obj_11)
   added: (pred_1 obj_09 obj_03) (pred_3 obj_04 obj_11)
   goals met: 1 of 2
6. (op_2 obj_04 obj_03 obj_08)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_08)
   goals met: 1 of 2
7. (op_1 obj_04 obj_10 obj_08 obj_02)
   deleted: (pred_4 obj_04 obj_10 obj_02)
   added: (pred_1 obj_10 obj_08) (pred_3 obj_04 obj_02)
   goals met: 2 of 2
